{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"dropout_input": {"name": "dropout_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"output-layer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/hidden-layer1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "1176"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1176"}, {"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer1/Relu", "op": "_FusedMatMul", "input": ["dropout_input", "StatefulPartitionedCall/sequential_3/hidden-layer1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/hidden-layer1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/hidden-layer1/Relu", "StatefulPartitionedCall/sequential_3/hidden-layer2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/hidden-layer2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/hidden-layer2/Relu", "StatefulPartitionedCall/sequential_3/output-layer/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/output-layer/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_3/output-layer/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/output-layer/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/hidden-layer1/MatMul/ReadVariableOp", "shape": [784, 1176], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer1/BiasAdd/ReadVariableOp", "shape": [1176], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer2/MatMul/ReadVariableOp", "shape": [1176, 784], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/hidden-layer2/BiasAdd/ReadVariableOp", "shape": [784], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/MatMul/ReadVariableOp", "shape": [784, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/output-layer/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}